Revit 2024 API
MEPNetworkSegmentData.Coefficient Property
 The calculated coefficient of this segment, dimensionless.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double Coefficient { get; }
Visual Basic
Public ReadOnly Property Coefficient As Double
	Get
Visual C++
public:
property double Coefficient {
	double get ();
}
See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace